[
  {
    "title": "Organizador de Archivos Inteligente",
    "technologies": ["Python", "Watchdog", "OS/Shutil"],
    "description_short": "Automatización en Python para la clasificación dinámica de archivos y monitoreo de directorios en tiempo real.",
    "description_long": "Gestión Híbrida: Organiza archivos existentes al iniciar y mantiene vigilancia activa de nuevos ingresos. Infraestructura Dinámica: Genera automáticamente las carpetas de destino según la extensión del archivo. Integridad de Datos: Sistema de numeración secuencial para evitar sobrescritura en nombres duplicados. Filtros de Exclusión: Protección de archivos críticos y del código fuente para asegurar la estabilidad del entorno.",
    "client": "Proyecto Personal",
    "date": "Enero, 2026",
    "url": "https://github.com/MariNaselli/Proyecto-Organizador-Python/",
    "project_name": "Proyecto-Organizador-Python",
    "carrousel_images": [
      "assets/img/portfolio/antes.png",
      "assets/img/portfolio/despues.png"
    ]
  },
  {
    "title": "Sitio Web SEPREVE Consultora",
    "technologies": ["Wordpress", "Elementor"],
    "description_short": "Desarrollo y soporte técnico de plataforma web institucional mediante CMS WordPress.",
    "description_long": "Implementación Técnica: Lideré la puesta en marcha de la plataforma asegurando funcionalidad y usabilidad. Colaboración Interdisciplinaria: Ejecución técnica del Front-end basada en diseños provistos por equipo de comunicación. Page Builders: Desarrollo visual y estructural completo mediante Elementor para una gestión de contenidos eficiente. Gestión de Desafíos: Resolución autodidacta de configuraciones críticas y optimización de entrega al cliente.",
    "client": "SEPREVE Consultora",
    "date": "Agosto, 2025",
    "url": "https://consultorasepreve.com/",
    "project_name": "Desarrollo web",
    "carrousel_images": [
      "assets/img/portfolio/sepreve.png"
    ]
  },
  {
    "title": "Portfolio Personal",
    "technologies": ["Angular", "HTML"],
    "description_short": "Adaptación de template HTML a Angular utilizando componentes, enrutamiento, mocks y servicios.",
    "description_long": "Adaptación de Template: Conversión de archivos estáticos a componentes dinámicos de Angular. Manejo de Datos: Implementación de mocks y servicios para una gestión de datos fluida y escalable. Navegación: Uso de sistema de rutas (Routing) para una experiencia Single Page Application (SPA). Despliegue: Configuración y hosting mediante GitHub Pages para accesibilidad online.",
    "client": "Mariana Naselli",
    "date": "Noviembre, 2024",
    "url": "https://marinaselli.github.io/",
    "url_github": "https://github.com/MariNaselli/marinaselli.github.io",
    "project_name": "Portfolio Personal",
    "carrousel_images": [
      "assets/img/portfolio/portfolio-angular.jpg",
      "assets/img/portfolio/portfolio-angular-2.jpg"
    ]
  },
  {
    "title": "Red de Portfolios Profesionales",
    "technologies": ["Angular", "Spring Boot", "Node.js", "NestJS", "MySQL"],
    "description_short": "Evolución de un portfolio web editable a una red profesional con autenticación y backend escalable.",
    "description_long": "Seguridad y Acceso: Implementación de sistema de autenticación dinámico con creación de cuentas de usuario. Migración Tecnológica: Evolución del backend de Spring Boot (Java) a una arquitectura moderna en Node.js con NestJS. Red Profesional: Transformación de perfil único a una red de usuarios con tarjetas interactivas y perfiles individuales. Cloud Hosting: Despliegue integral utilizando servicios como Firebase, Render y Clever Cloud.",
    "client": "Argentina Programa",
    "date": "2021 - 2024",
    "url": "https://portfolio-web-2559b.web.app/",
    "url_github": "https://github.com/MariNaselli/portfolio-FrontEnd",
    "project_name": "Mi primer proyecto",
    "carrousel_images": [
      "assets/img/portfolio/1.png",
      "assets/img/portfolio/2.png"
    ]
  }
]
