{
  "resume": {
    "technologies": [
      "HTML",
      "CSS",
      "JavaScript",
      "Angular",
      "Bootstrap",
      "Node.js",
      "Git",
      "Spring Boot",
      "MySQL",
      "SQL",
      "C#",
      "NET",
      "MAUI",
      "OpenIa"
    ],
    "education": [
        {
        "degree": "Tecnicatura en Programación",
        "year": "En curso",
        "institution": "Universidad Tecnológica Nacional - FRSN",
        "details": ""
      },
       {
        "degree": "Percorso Programmazione APP",
        "year": "2024",
        "institution": "Train for Digital, Polo Universitario Città di Prato",
        "details": "He adquirido competencias en la programación funcional en C#, bases de datos relacionales, lenguaje SQL, implementación de aplicaciones con C# y .NET. Realicé una práctica profesional de dos semanas y media en la empresa Remira en Florencia, Italia, donde participé en un proyecto de desarrollo de una aplicación web utilizando MAUI."
      },
      {
        "degree": "Plataforma de educación en línea",
        "year": "2020 a 2023",
        "institution": "Platzi",
        "details": ""
      },
      {
        "degree": "Web Full Stack Junior",
        "year": "2022 - 2023",
        "institution": "Argentina Programa",
        "details": "Desarrollo de una aplicación web centrada en la creación de un portafolio web personalizado. Uso de Angular para el front-end y Spring Boot para el backend, con una arquitectura distribuida para la comunicación entre el front-end y la base de datos MySQL para la gestión de datos."
      },
      {
        "degree": "Martillero Público y Corredor de Comercio",
        "year": "2008 - 2014",
        "institution": "Instituto CEBA",
        "details": ""
      }
    ],
    "experience": [
      {
        "position": "Desarrollo Sitio Web",
        "year": "05-2025 - 08-2023",
        "company": "Consultora SEPREVE",
        "responsibilities": [
          "Implementación técnica del sitio web funcional, asegurando la correcta puesta en marcha de la plataforma WordPress.",
          "Trabajé en equipo con una diseñadora y una comunicadora, encargándome de la ejecución técnica y la funcionalidad del Front-end basada en los diseños provistos.",
          "Uso de Page Builders y CMS: Desarrollo visual completo de la estructura y el contenido mediante el constructor Elementor, lo que permitió una creación rápida y eficiente del sitio."
        ]
      },
      {
        "position": "Colaboración en un proyecto de mejora del front-end",
        "year": "05-2023 - 10-2023",
        "company": "Daskalos Solutions",
        "responsibilities": [
          "Actualizaciones en una aplicación con tecnología Angular",
          "Adquisición de datos de una API RESTful",
          "Visualización de los datos obtenidos de la API"
        ]
      },
      {
        "position": "Administrativa",
        "year": "10-2015 - 10-2023",
        "company": "Administración José Peretti/Pietro S.A",
        "responsibilities": [
          "Gestión integrada de la administración de condominios e inmuebles",
          "Liquidación precisa de gastos condominiales y alquileres utilizando sistemas especializados y herramientas como Excel para realizar cálculos y generar informes",
          "Gestión de operaciones bancarias y pagos a proveedores",
          "Organización y mantenimiento de un sistema de archivo documental",
          "Digitalización de documentación y colaboración en la implementación de un nuevo sistema de liquidación de gastos condominiales, con especial atención en supervisar la precisión de los datos migrados para garantizar una transición sin problemas"
        ]
      }
    ]
  }
}






  